In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

# 1. Series
- DataFrame 중 하나의 column에 해당하는 데이터의 모음 Object  
- Subclass of numpy, ndarray  
- Data: any type  
- Index labels need not be ordered  
- Duplicates are possible but result in reduced functionality

<img src="./img/pandas_series.png" width="600" style="float:left">

In [2]:
list_data = [1,2,3,4,5]
example_obj = Series(data = list_data)
example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
list_data = [1,2,3,4,5]
list_name = ["a", "b", "c", "d", "e"]
example_obj = Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [7]:
example_obj["a"]

1.0

In [8]:
example_obj["a"] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [9]:
example_obj.values

array([3.2, 2. , 3. , 4. , 5. ], dtype=float32)

In [10]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
example_obj.name = "number"
example_obj.index.name = "alphabet"
example_obj

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

In [13]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a", "b", "c", "d", "e", "f", "g", "h"]
series_obj_1 = Series(dict_data_1, index=indexes)
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

# 2. DataFrame

- NumPy array-like  
- Each column can have a different type  
- Row and column index  
- Size mutable: insert and delete columns

In [14]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
           'last_name' : ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age' : [42, 52, 36, 24, 73],
            'city' : ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']
           }
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [15]:
# column 선택
DataFrame(raw_data, columns = ['age', 'city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [16]:
# 새로운 column 추가
DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [17]:
# column 선택 - series 추출 1 
df = DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [18]:
# column 선택- series 추출 2
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [19]:
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [20]:
# loc : index location
df.loc[1] # index 1에 해당하는 데이터 추출

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [21]:
# iloc : index position
df['age'].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

- loc은 index이름, iloc은 index number

In [25]:
s = pd.Series(np.nan, index=[49,48,47,46,45,1,2,3,4,5])
s.loc[:3] # index '이름'이 3인 데이터까지 추출

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [26]:
s.iloc[:3] #3번째 index까지 데이터 추출

49   NaN
48   NaN
47   NaN
dtype: float64

In [27]:
# column에 새로운 데이터 할당 1 
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [35]:
# column에 새로운 데이터 할당 2
values = Series(data=["M", "F", "F"], index=[0,1,2])
df["sex"] = values
df

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Francisco    M
1      Molly  Jacobson   52      Baltimore    F
2       Tina       Ali   36          Miami    F
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [28]:
# transpose
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [29]:
# 값 출력
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [30]:
# csv 파일로
df.to_csv()

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Molly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [32]:
# column 삭제
del df['debt']

In [33]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [34]:
# example from python for data analysis with nested dict
pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio' : {2000:1.5, 2001:1.7, 2002:3.6}}
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

# 3. Selection & Drop

In [45]:
data = "./resource/excel-comp-data.xlsx"
df = pd.read_excel(data)
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

# 3-1) Selection

In [42]:
# select "account" column 
df['account'].head(3)

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [44]:
# select multiple columns
df[['account', 'street', 'state']].head(3)

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa

In [46]:
# column 이름없이 사용하는 index number는 row 기준 표시
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [47]:
# column이름과 함께 row index 사용시 해당 column만
df['account'][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

### Series Selection

In [48]:
account_series = df['account']
account_series[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [51]:
account_series[[1, 5, 2]]

1    320563
5    132971
2    648336
Name: account, dtype: int64

In [52]:
account_series[account_series < 250000]

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

### Index 변경

In [53]:
df.index = df['account']
del df['account']
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

### Basic, loc, iloc Selection

In [55]:
# column과 index number
df[['name', 'street']][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [56]:
# index name과 column
df.loc[[211829,320563], ['name', 'street']]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [58]:
# index number와 column number
df.iloc[:3, :2]

                               name                                street
account
211829   Kerluke, Koepp and Hilpert                    34456 Sean Highway
320563               Walter-Trantow                     1311 Alvis Tunnel
648336   Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231

In [59]:
# 가장 많이 쓰는 방법
df[['name', 'street']].iloc[:3]

                               name                                street
account
211829   Kerluke, Koepp and Hilpert                    34456 Sean Highway
320563               Walter-Trantow                     1311 Alvis Tunnel
648336   Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231

### index 재설정

In [60]:
df.index = list(range(0,15))
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

## 3-2) Drop

In [63]:
# index number로 drop
df.drop(1) # index 1에 있는 데이터 drop

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [64]:
# 한 개 이상의 index number로 drop
df.drop([0,1,2,3]) # df.drop([0,1,2,3,], inplace=True) 로 하면 df가 바뀜

,name,street,city,state,postal-code,Jan,Feb,Mar
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [65]:
# axis 기준으로 drop
df.drop('city', axis=1)

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

In [66]:
matrix = df.as_matrix()
matrix[:3]

c:\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.

array([['Kerluke, Koepp and Hilpert', '34456 Sean Highway', 'New Jaycob',
        'Texas', 28752, 10000, 62000, 35000],
       ['Walter-Trantow', '1311 Alvis Tunnel', 'Port Khadijah',
        'NorthCarolina', 38365, 95000, 45000, 35000],
       ['Bashirian, Kunde and Price',
        '62184 Schamberger Underpass Apt. 231', 'New Lilianland', 'Iowa',
        76517, 91000, 120000, 35000]], dtype=object)

In [67]:
matrix[:, -3:]

array([[10000, 62000, 35000],
       [95000, 45000, 35000],
       [91000, 120000, 35000],
       [45000, 120000, 10000],
       [162000, 120000, 35000],
       [150000, 120000, 35000],
       [62000, 120000, 70000],
       [145000, 95000, 35000],
       [70000, 95000, 35000],
       [70000, 120000, 35000],
       [45000, 120000, 55000],
       [150000, 10000, 162000],
       [162000, 120000, 35000],
       [55000, 120000, 35000],
       [150000, 120000, 70000]], dtype=object)

In [68]:
matrix[:, -3:].sum(axis=1)

array([107000, 175000, 246000, 175000, 317000, 305000, 252000, 275000,
       200000, 225000, 220000, 322000, 317000, 210000, 340000],
      dtype=object)

In [69]:
df.drop('city', axis=1)

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

In [70]:
df.drop(['city', 'state'], axis=1)

,name,street,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,27933,150000,120000,70000

# 4. DataFrame Operations

## 4-1) Series Operation
- Operation types: add, sub, div, mul

In [3]:
s1 = Series(range(1,6), index=list("abcde"))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
s2 = Series(range(5,11), index=list("bcdefg"))
s2

b     5
c     6
d     7
e     8
f     9
g    10
dtype: int64

- add : index를 기준으로 연산수행, 겹치는 index가 없을 경우 NaN값으로 반환

In [5]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    11.0
e    13.0
f     NaN
g     NaN
dtype: float64

In [6]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    11.0
e    13.0
f     NaN
g     NaN
dtype: float64

In [7]:
# fill value
s1.add(s2, fill_value=0)

a     1.0
b     7.0
c     9.0
d    11.0
e    13.0
f     9.0
g    10.0
dtype: float64

## 4-2) DataFrame Operation
- Operation types: add, sub, div, mul

In [8]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [10]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [12]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

- df는 column과 index를 모두 고려  
- add operation을 쓰면 NaN값 0으로 변환

## 4-3) Series + DataFrame

In [13]:
df = DataFrame(np.arange(16).reshape(4,4), columns = list('abcd'))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
s = Series(np.arange(10,14), index=list('abcd'))
s

a    10
b    11
c    12
d    13
dtype: int32

In [15]:
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

- column을 기준으로 broadcasting 발생

In [16]:
df = DataFrame(np.arange(16).reshape(4,4), columns = list('abcd'))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
s2 = Series(np.arange(10,14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [19]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [18]:
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

- axis 기준으로 row broadcasting 실행

# 5. Lambda, map, apply

## lambda
- 한 줄로 함수를 표현하는 익명 함수 기법  
- **lambda** argument : expression  
- `lambda x,y : x + y`

## map 
- 함수와 sequence형 데이터를 인자로 받아 각 element마다 입력받은 함수를 적용하여 list로 반환  
- 일반적으로 함수를 lambda형태로 표현함  
- **list**(**map**(function, sequence))  
`ex = [1,2,3,4,5]
f = lambda x: x ** 2
list(map(f, ex))
#[1,4,9,16,25]`

## 5-1) map for Series
- Pandas의 series type의 데이터에도 map함수 사용가능  
- function대신 dict, sequence형 자료등으로 대체가능

In [ ]:
# example 1

In [20]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [21]:
s1.map(lambda x: x ** 2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [22]:
# example 2 : dict type으로 데이터 교체, 없는 값은 NaN

In [23]:
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [24]:
# example 3 : 같은 위치의 데이터를 s2로 전환

In [26]:
s2 = Series(np.arange(10,20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int32

### 5-1-1) Simple Examle

In [40]:
df = pd.read_csv("./resource/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [28]:
# unique값만 표시
df.sex.unique()

array(['male', 'female'], dtype=object)

In [41]:
# map을 이용해서 sex_code column 추가
df['sex_code'] = df.sex.map({'male' : 0, 'female': 1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

## 5-2) Replace Function
- map함수의 기능중 데이터 변환 기능만 담당  
- 데이터 변환시 많이 사용하는 함수

In [30]:
# dict type 적용
df.sex.replace({'male':0, 'female':1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [42]:
# replace(target_list, conversion_list, inplace)
df.sex.replace(['male', 'female'], [0,1], inplace=True)
df.head(5)

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [43]:
del df['sex_code']
df.head(5)

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

## 5-2) apply for DataFrame
- map과 달리, series 전체(column)에 해당 함수를 적용  
- 입력값이 series 데이터로 입력받아 handling 가능

In [44]:
df_info = df[['earn', 'height', 'age']]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [45]:
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

- 내장 연산 함수를 사용할 때도 똑같은 효과를 거둘 수 있음  
- mean, std 등

In [47]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [48]:
df_info.apply(sum) #결과는 위와 같음

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

- scalar 값 이외에 serires값의 반환도 가능함

In [49]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

## 5-3) applymap for DataFrame
- series 단위가 아닌 element 단위로 함수를 적용함  
- series 단위에 apply를 적용시킬 때와 같은 효과

In [50]:
f = lambda x: -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [51]:
f = lambda x : -x
df_info['earn'].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

# 6. Pandas Built-in Functions

## 6-1) describe
- Numeric type 데이터의 요약 정보를 보여줌

In [70]:
df = pd.read_csv('./resource/wages.csv')
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [54]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

## 6-2) unique
- series data의 unique한 값을 list로 반환함

In [55]:
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [61]:
# example 1

In [56]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [71]:
np.array(dict(sorted(enumerate(df['race'].unique()))))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [62]:
### example 2 ###

In [73]:
value = list(map(int, np.array(list(enumerate(df['race'].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df['race'].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [74]:
df['race'].replace(to_replace=key, value=value, inplace=True)
df.head()

           earn  height     sex  race  ed  age
0  79571.299011   73.89    male     0  16   49
1  96396.988643   66.23  female     0  16   62
2  48710.666947   63.77  female     0  16   33
3  80478.096153   63.22  female     1  16   95
4  82089.345498   63.08  female     0  17   43

In [75]:
value = list(map(int, np.array(list(enumerate(df['sex'].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df['sex'].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1], ['male', 'female'])

In [76]:
df['sex'].replace(to_replace=key, value=value, inplace=True)
df.head()

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

In [ ]:
# 내가 혼자 해본 것

In [59]:
np.array(list(enumerate(df['race'].unique())), dtype=str)

array([['0', 'white'],
       ['1', 'other'],
       ['2', 'hispanic'],
       ['3', 'black']], dtype='<U8')

In [67]:
new_array = np.array(list(enumerate(df['race'].unique())), dtype=str)
value = list(map(int, new_array[:, 0]))
key = new_array[:,1].tolist()
value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

## 6-3) sum
- 기본적인 column 또는 row값의 연산을 지원  
- sub, mean, min, max, count, median, mad, var 등

In [77]:
df.sum(axis=0) # column 별

earn      4.474344e+07
height    9.183125e+04
sex       8.590000e+02
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [79]:
df.sum(axis=1)[:5] # row 별

0    79710.189011
1    96542.218643
2    48824.436947
3    80654.316153
4    82213.425498
dtype: float64

## 6-4) isnull
- column 또는 row값의 NaN (null)값의 index를 반환함

In [81]:
df.isnull().head()

    earn  height    sex   race     ed    age
0  False   False  False  False  False  False
1  False   False  False  False  False  False
2  False   False  False  False  False  False
3  False   False  False  False  False  False
4  False   False  False  False  False  False

In [82]:
df.isnull().sum() #isnull이 True인 경우의 수를 셀 때 사용

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

## 6-5) sort_values
- column 값을 기준으로 데이터를 sorting

In [83]:
df.sort_values(['age', 'earn'], ascending=True).head(10) #age먼저, earn은 그 다음

             earn  height  sex  race  ed  age
1038   -56.321979   67.81    0     2  10   22
800    -27.876819   72.29    0     0  12   22
963    -25.655260   68.90    0     0  12   22
1105   988.565070   64.71    1     0  12   22
801   1000.221504   64.09    1     0  12   22
862   1002.023843   66.59    1     0  12   22
933   1007.994941   68.26    1     0  12   22
988   1578.542814   64.53    0     0  12   22
522   1955.168187   69.87    1     3  12   22
765   2581.870402   64.79    1     0  12   22

## 6-6) cumsum, cummax
- cumulative sum: 시간에 따른 주식 거래량 등을 파악할때 유용  
- cumulative max: 정해진 시간동안의 max 파악할때 유용

In [84]:
df.cumsum().head()

            earn  height  sex  race    ed    age
0   79571.299011   73.89  0.0   0.0  16.0   49.0
1  175968.287654  140.12  1.0   0.0  32.0  111.0
2  224678.954602  203.89  2.0   0.0  48.0  144.0
3  305157.050754  267.11  3.0   1.0  64.0  239.0
4  387246.396253  330.19  4.0   1.0  81.0  282.0

In [85]:
df.cummax().head() #각 column마다 cummax 표현

           earn  height  sex  race    ed   age
0  79571.299011   73.89  0.0   0.0  16.0  49.0
1  96396.988643   73.89  1.0   0.0  16.0  62.0
2  96396.988643   73.89  1.0   0.0  16.0  62.0
3  96396.988643   73.89  1.0   1.0  16.0  95.0
4  96396.988643   73.89  1.0   1.0  17.0  95.0

## 6-7) Correlation & Covariance
- 상관계수와 공분산을 구하는 함수  
- corr, cov, corrwith

### 6-7-1) corr == correlation coefficient
- -1 < corr < 1  
- The closer the coefficient is to either −1 or 1, the stronger the correlation between the variables.  
- correlation의 강도를 알 수 있음

<img src='./img/pd_corr.png' width="400" style="float:left">

<img src='./img/pd_corr_indep.png' width="400" style="float:left">

In [87]:
df.age.corr(df.earn)

0.07400349177836058

### 6-7-2) cov = covariance
- The sign of the covariance therefore shows the tendency in the linear relationship between the variables.  
- The magnitude of the covariance is not easy to interpret because it is not normalized and hence depends on the magnitudes of the variables.  
- The normalized version of the covariance, the correlation coefficient, however, shows by its magnitude the strength of the linear relation.
- positive/negative tendency는 알수있으나 correlation의 강도는 알 수 없음

<img src='./img/pd_cov.png' width="400" style="float:left">

<img src="./img/pd_cov_2.png" width="500" style="float:left">

In [88]:
df.age.cov(df.earn)

36523.6992104089

### 6-7-3) corrwith : correlation coeff with other features

In [89]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

전체 상관관계

In [90]:
df.corr()

            earn    height       sex      race        ed       age
earn    1.000000  0.291600 -0.337328 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.703672 -0.045974  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036
race   -0.063977 -0.045974  0.000858  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.061747 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.056879 -0.129802  1.000000

In [91]:
# example 1 : age x earn

In [92]:
df.age.corr(df.earn)

0.07400349177836058

In [93]:
df.age[df.age<55].corr(df.earn) # age<55인 age와 earn의 corr

0.29378871716236815

In [95]:
df.age[(df.age < 45) & (df.age > 25)].corr(df.earn)

0.21238097035942677

In [96]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

### 6-8) value_counts

In [97]:
df.sex.value_counts(sort=True)

1    859
0    520
Name: sex, dtype: int64